Revit 2027 API
BracePlanRepresentation Enumeration
 The possible representations for braces in plan views.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum BracePlanRepresentation
Public Enumeration BracePlanRepresentation
public enum class BracePlanRepresentation
type BracePlanRepresentation
Members
Member name | Value | Description
LineWithAngle | 2 |  Braces are represented by a line with angle.
ParallelLine | 1 |  Braces are represented by a parallel line.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace